In [11]:
import pandas as pd
import numpy as np

bank_data = pd.read_csv("bank.csv")

bank_data

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [12]:
bank_data.iloc[1, 1]

'services'

In [13]:
bank_data.iloc[:11:2, :11:2]

    age  marital default housing   contact month
0    30  married      no      no  cellular   oct
2    35   single      no     yes  cellular   apr
4    59  married      no     yes   unknown   may
6    36  married      no     yes  cellular   may
8    41  married      no     yes   unknown   may
10   39  married      no     yes   unknown   may

In [14]:
bank_data.iloc[100:110, :10]

,age,job,marital,education,default,balance,housing,loan,contact,day
100,36,blue-collar,married,secondary,no,0,yes,no,unknown,6
101,38,management,single,tertiary,no,493,yes,no,cellular,11
102,49,technician,married,secondary,no,5996,no,no,telephone,21
103,57,services,single,primary,no,3777,yes,no,telephone,13
104,34,management,single,secondary,no,524,no,no,unknown,13
105,32,management,single,tertiary,no,574,yes,no,cellular,14
106,37,blue-collar,married,secondary,no,427,yes,yes,unknown,9
107,33,self-employed,married,tertiary,no,483,yes,no,cellular,3
108,56,unemployed,married,primary,no,3391,no,no,cellular,21
109,27,housemaid,married,primary,no,0,yes,no,cellular,23

In [15]:
bank_data.loc[:10:2, ["age", "marital", "default", "housing", "contact", "month"]]

    age  marital default housing   contact month
0    30  married      no      no  cellular   oct
2    35   single      no     yes  cellular   apr
4    59  married      no     yes   unknown   may
6    36  married      no     yes  cellular   may
8    41  married      no     yes   unknown   may
10   39  married      no     yes   unknown   may